<a href="https://colab.research.google.com/github/barja8/python_intro/blob/master/py_session004.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to pandas

In [0]:
import pandas as pd

In [4]:
data = pd.read_csv('http://faculty.marshall.usc.edu/gareth-james/ISL/Auto.csv')
print(data)

      mpg  cylinders  displacement  ... year  origin                       name
0    18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1    15.0          8         350.0  ...   70       1          buick skylark 320
2    18.0          8         318.0  ...   70       1         plymouth satellite
3    16.0          8         304.0  ...   70       1              amc rebel sst
4    17.0          8         302.0  ...   70       1                ford torino
..    ...        ...           ...  ...  ...     ...                        ...
392  27.0          4         140.0  ...   82       1            ford mustang gl
393  44.0          4          97.0  ...   82       2                  vw pickup
394  32.0          4         135.0  ...   82       1              dodge rampage
395  28.0          4         120.0  ...   82       1                ford ranger
396  31.0          4         119.0  ...   82       1                 chevy s-10

[397 rows x 9 columns]

In [6]:
data.head()

    mpg  cylinders  displacement  ... year  origin                       name
0  18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...   70       1          buick skylark 320
2  18.0          8         318.0  ...   70       1         plymouth satellite
3  16.0          8         304.0  ...   70       1              amc rebel sst
4  17.0          8         302.0  ...   70       1                ford torino

[5 rows x 9 columns]

In [7]:
data.tail()

      mpg  cylinders  displacement  ... year  origin             name
392  27.0          4         140.0  ...   82       1  ford mustang gl
393  44.0          4          97.0  ...   82       2        vw pickup
394  32.0          4         135.0  ...   82       1    dodge rampage
395  28.0          4         120.0  ...   82       1      ford ranger
396  31.0          4         119.0  ...   82       1       chevy s-10

[5 rows x 9 columns]

In [0]:
# data.head(3) # The same is the function tail()